DELETE
FROM user_roles;
DELETE
FROM meals;
DELETE
FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (user_id, description, date_time, calories)
VALUES (100000, 'Завтрак чемпиона', '2021-01-30 11:00:00', 750),
       (100000, 'Обед чемпиона', '2021-01-30 12:00:00', 1200),
       (100000, 'Легкий ужин', '2021-01-30 21:00:00', 200),
       (100000, 'Ночной перекус на бульваре роз', '2021-01-31 00:00:00', 750),
       (100000, 'Завтрак чемпиона', '2021-01-31 11:00:00', 1200),
       (100000, 'Обед чемпиона', '2021-01-31 12:00:00', 750),
       (100000, 'Ужин чемпиона', '2021-01-31 21:00:00', 250),
       (100001, 'Завтрак', '2021-01-30 11:00:00', 500),
       (100001, 'Обед', '2021-01-30 13:00:00', 1000),
       (100001, 'Ужин', '2021-01-30 20:00:00', 500),
       (100001, 'Еда на граничное значение', '2021-01-31 00:00:00', 100),
       (100001, 'Завтрак', '2021-01-31 10:00:00', 1000),
       (100001, 'Обед', '2021-01-31 13:00:00', 500),
       (100001, 'Ужин', '2021-01-31 20:00:00', 410),
       (100000, 'T E S T', '2022-10-10 13:00:00', 15);
